Repository: OpenKNX/Kaenx-Creator
Catalog: Kaenx.Creator/Properties/Messages.*.resx
Languages: de, fr

# check_ver_mod_combase
source: Module {0}: ComObjectBaseNumber Argument is not of type numeric
de: Modul {0}: ComObjectBaseNumer Argument ist nicht vom Typ Numerisch
fr: Module {0}: l'argument de ComObjectBaseNumber n'est de type numérique

# check_ver_dyn_items
source: Dynamic has no elements
de: Dynamic hat keine Elemente
fr: La vue Dynamic est vide

# check_ver_para_type
source: Parameter {0} ({1}): No ParameterType selected
de: Parameter {0} ({1}): Kein ParameterTyp ausgewählt
fr: Paramètre {0} ({1}): Pas de ParameterType sélectionné

# check_ver_para_text
source: Parameter {0} ({1}): Value needs more memory ({2}) than his size ({3})
de: Parameter {0} ({1}): Wert benötigt mehr Speicher ({2}) als verfügbar ({3})
fr: Paramètre {0} ({1}): La valeur nécessite plus de mémoire ({2}) que sa taille ({3})

# check_ver_para_enum1
source: {0} {1} ({2}): Value is not an integer
de: {0} {1} ({2}): Wert ist keine Ganzzahl
fr: {0} {1} ({2}): La valeur n'est pas un entier

# check_ver_para_enum2
source: {0} {1} ({2}): Value ist not availible as an option
de: {0} {1} ({2}): Wert ist nicht als Option verfügbar
fr: {0} {1} ({2}): La valeur n'est une option disponible

# check_ver_para_number1
source: {0} {1} ({2}): Value is not an integer
de: {0} {1} ({2}): Wert ist keine Ganzzahl
fr: {0} {1} ({2}): La valeur n'est pas un entier

# check_ver_para_number2
source: {0} {1} ({2}): Value is not in the supported range
de: {0} {1} ({2}): Wert ist nicht im verfügbaren Rahmen
fr: {0} {1} ({2}): La valeur n'est pas la plage

# check_ver_para_float
source: {0} {1} ({2}): Value is not an floating point number
de: {0} {1} ({2}): Wert ist keine Gleitkommazahl

# check_ver_para_color
source: {0} {1} ({2}): Value is not in the given format {3}
de: {0} {1} ({2}): Wert hat nicht das richtige Format {3}
fr: {0} {1} ({2}): La valeur n'est pas au format défini {3}

# check_ver_para_raw1
source: {0} {1} ({2}): Value has an odd number of chars
de: {0} {1} ({2}): Wert hat eine ungerade Anzahl an Zeichen
fr: {0} {1} ({2}): La valeur a un nombre impair de caractères

# check_ver_para_raw2
source: {0} {1} ({2}): Value needs more memory ({3}) than his size ({4})
de: {0} {1} ({2}): Wert benötigt mehr Speicher ({3}) als verfügbar ({4})
fr: {0} {1} ({2}): La valeur nécessite plus de mémoire ({3}) que sa taille ({4})

# check_ver_para_raw3
source: {0} {1} ({2}): Value is not a valid hex
de: {0} {1} ({2}): Wert ist kein gültiger Hex-Wert
fr: {0} {1} ({2}): La valeur n'est une valeur hexadécimale valide

# check_ver_para_date
source: {0} {1} ({2}): Value has not the correct date format 'YYYY-MM-DD'
de: {0} {1} ({2}): Wert hat nicht das Format 'YYYY-MM-DD'
fr: {0} {1} ({2}): La valeur n'est pas au format date 'YYYY-MM-DD'

# check_ver_lang_no_translation
source: {0} {1} ({2}): Is not translated
de: {0} {1} ({2}): Wurde nicht übersetzt
fr: {0} {1} ({2}): N'est pas traduit

# check_ver_lang_not_all
source: {0} {1} ({2}): Is not translated in all languages
de: {0} {1} ({2}): Wurde nicht in alle Sprachen übersetzt
fr: {0} {1} ({2}): N'est pas traduit dans toutes les langues

# check_ver_lang_suffix
source: {0} {1} ({2}): Suffix is not translated in all languages
de: {0} {1} ({2}): Suffix wurde nicht in alle Sprachen übersetzt
fr: {0} {1} ({2}): Suffix non traduit dans toutes les langues

# check_ver_para_save_error
source: Parameter {0} ({1}): No Memorysegment selected
de: Parameter {0} ({1}): Kein Speichersegment ausgewählt
fr: Paramètre {0} ({1}): pas de segment de mémoire sélectionné

# check_ver_para_save_offset
source: Parameter {0} ({1}): Offset is not set
de: Parameter {0} ({1}): Offset wurde nicht angegeben
fr: Paramètre {0} ({1}): Offset non défini

# check_ver_para_save_offsetbit
source: Parameter {0} ({1}): Bit Offset is not set
de: Parameter {0} ({1}): Bit Offset wurde nicht angegeben
fr: Paramètre {0} ({1}): Bit d'Offset non défini

# check_ver_para_save_obsolet
source: Parameter {0} ({1}): Bit Offset can't be greather than 7
de: Parameter {0} ({1}): Bit Offset darf nicht größer als 7 sein
fr: Paramètre {0} ({1}): Bit d'Offset ne peut être supérieur à 7

# check_ver_para_save_objectindex
source: Parameter {0} ({1}): ObjectType is not set
de: Parameter {0} ({1}): ObjectType wurde nicht angegeben

# check_ver_para_save_propertyid
source: Parameter {0} ({1}): PropertyId is not set
de: Parameter {0} ({1}): Propertyid wurde nicht angegeben
fr: Parameter {0} ({1}): La valeur PropertyId n'est pas fixée

# check_ver_para_save_union
source: Parameter {0} ({1}): Union is not set
de: Parameter {0} ({1}): Union wurde nicht angegeben
fr: Parameter {0} ({1}): L'Union n'est pas définie

# check_ver_lang_suffix_length
source: {0} {1} ({2}): Suffix has more than 20 chars
de: {0} {1} ({2}): Suffix hat mehr als 20 Zeichen
fr: {0} {1} ({2}): Le Suffix a plus de 20 caractères

# check_ver_pararef_no_para
source: ParameterRef {0} ({1}): No parameter selected
de: ParameterRef {0} ({1}): Kein Parameter ausgewählt
fr: ParameterRef {0} ({1}): Pas de paramètre sélectionné

# check_ver_pararef_no_display_order
source: ParameterRef {0} ({1}): At PreETS4 the DisplayOrder has to be set
de: ParameterRef {0} ({1}): Bei PreETS4 muss die DisplayOrder gesetzt werden

# check_ver_com_not_unique
source: ComObjectNumbers are not unique. IDs will be counted up
de: ComObjectNumers sind nicht eindeutig. Die IDs werden aufsteigend neu vergeben
fr: Les ComObjectNumbers ne sont pas uniques. Les IDs seront renumérotés

# check_ver_com_no_dpt
source: ComObject {0} ({1}): No DatapointType selected
de: ComObject {0} ({1}): Kein DatapointType angegeben
fr: ComObject {0} ({1}): Pas de DatapointType sélectionné

# check_ver_com_no_dpt_ref
source: ComObject {0} ({1}): No DatapointType is only valid for ComObjectRef
de: ComObject {0} ({1}): Kein DatapointType angeben ist nur bei ComObjectRefs erlaubt
fr: ComObject {0} ({1}): L'option "Aucun DatapointType" n'est valide que pour les ComObjectRefs

# check_ver_com_no_dpst
source: ComObject {0} ({1}): No DatapointSubType selected
de: ComObject {0} ({1}): Kein DatapointType ausgewählt
fr: ComObject {0} ({1}): Pas de DatapointSubType sélectionné

# check_ver_com_no_textpara
source: {0} {1} ({2}): No TextParameter selected
de: {0} {1} ({2}): Kein TextParameter ausgewählt
fr: {0} {1} ({2}): Pas de TextParameter sélectionné

# check_ver_com_no_used_textpara
source: {0} {1} ({2}): TextParameter is selected but no {{{{0}}}} in text
de: {0} {1} ({2}) TextParameter wurde ausgewählt, allerdings ist im Text kein {{{{0}}}}
fr: {0} {1} ({2}): Un TextParameter est sélectionné mais pas de {{{{0}}}} dans le texte

# check_ver_comref_no_com
source: ComObjectRef {0} ({1}): No ComObject selected
de: ComObjectRef {0} ({1}): Kein ComObject ausgewählt
fr: ComObjectRef {0} ({1}): Pas de ComObject sélectionné

# check_ver_mods
source: Checking Module '{0}'
de: Überprüfe Modul '{0}'
fr: Vérification du Module '{0}'

# check_cat_dev_text_not_all
source: Device {0}: Text has not all languages of the application or is not translated
de: Gerät {0}: Text hat nicht alle Sprachen der Applikation oder wurde nicht in alle übersetzt
fr: Appareil {0}: Le texte n'est pas dans tous les langages de l'application ou n'est pas traduit

# check_cat_dev_desc_not_all
source: Device {0}: Description has not all languages of the application or is not translated
de: Gerät {0}: Beschreibung hat nicht alle Sprachen der Applikation oder wurde nicht in alle übersetzt
fr: Appareil {0}: La description n'est pas dans les langages de l'application ou n'est pas traduit

# check_cat_cat_text_not_all
source: Catalog {0}: Text has not all languages of the application or is not translated
de: Katalog {0}: Text hat nicht alle Sprachen der Applikation oder wurde nicht in alle übersetzt
fr: Le Catalogue {0}: Le texte n'est pas dans tous les langages de l'application ou n'est pas traduit

# check_dyn_channel_no_number
source: DynChannel {0}: Number is empty
de: DynChannel {0}: Nummer ist leer
fr: DynChannel {0}: Le numéro est vide

# check_dyn_channel_textpara
source: DynChannel {0}: No TextParameter selected
de: DynChannel {0}: Kein TextParameter ausgewählt
fr: DynChannel {0}: Pas de TextParameter sélectionné

# check_dyn_block_pref_error
source: DynParaBlock {0}: ParameterRef is only supported in ETS3. Activate IsPreETS4
de: DynParaBlock {0}: ParameterRef wird nur in ETS3 unterstützt. Aktivieren Sie die Option IsPreETS4
fr: DynParaBlock {0}: le ParameterRef n'est supporté que dans ETS3. Activerzl'option IsPreETS4.

# check_dyn_block_no_pref
source: DynParaBlock {0}: No ParameterRef selected
de: DynParaBlock {0}: Kein ParameterRef ausgewählt
fr: DynParaBlock {0}: Pas de ParameterRef sélectionné

# check_dyn_block_no_textpara
source: DynParaBlock {0}: No TextParameter selected
de: DynParaBlock {0}: Kein TextParameter ausgewählt
fr: DynParaBlock {0}: Pas de TextParameter sélectionné

# check_dyn_block_no_icon
source: DynParaBlock {0}: No Icon selected
de: DynParaBlock {0}: Kein Icon ausgewählt
fr: DynParaBlock {0}: Pas d'icône sélectionnée

# check_dyn_mod_no_module
source: DynModule {0}: No Module selected
de: DynModule {0}: Kein Modul ausgewählt
fr: DynModule {0}: Pas de Module sélectionné

# check_dyn_mod_empty_arg
source: DynModule {0}: At least one Argument is empty
de: DynModule {0}: Mindestens ein Argument ist leer
fr: DynModule {0}: Au moins un argument est vide

# check_dyn_mod_no_alloc
source: DynModule {0}: An Allocator must be associated
de: DynModule {0}: Ein Allokator muss referenziert werden
fr: DynModule {0}: Un Allocator Doit être associé

# check_dyn_mod_alloc_error
source: DynModule {0}: At least one Argument has an Allocator which is not Numeric
de: DynModule {0}: Mindestens ein Argument hat einen Allokator, der nicht vom Typ Numeric ist
fr: DynModule {0}: Au moins un argument a un Allocator qui n'est pas un numérique

# check_dyn_choose_no_pararef
source: DynChoose {0}: No ParameterRef selected
de: DynChoose {0}: Kein ParameterRef ausgewählt
fr: DynChoose {0}: Pas de ParameterRef sélectionné

# check_dyn_when_no_cond
source: DynWhen {0}: Condition is empty
de: DynWhen {0}: Bedingung ist leer
fr: DynWhen {0}: La condition est vide

# check_dyn_when_default
source: DynWhen {0}: Set as default. Condition will be ignored
de: DynWhen {0}: Als Default gesetzt. Bedingung wird ignoriert
fr: DynWhen {0}: Activé par défaut. La condition sera ignorée

# check_dyn_para_no_ref
source: DynParameter {0}: No ParameterRef selected
de: DynParameter {0}: Kein ParameterRef ausgewählt
fr: DynParameter {0}: Pas de ParameterRef sélectionné

# check_dyn_para_no_help
source: DynParameter {0}: No Helptext selected
de: DynParameter {0}: Kein Hilfetext ausgewählt
fr: DynParameter {0}: Pas de Helptext sélectionné

# check_dyn_com_no_ref
source: DynComObject {0}: No ComObjectRef selected
de: DynComObject {0}: Kein ComObjectRef ausgewählt
fr: DynComObject {0}: Pas de ComObjectRef sélectionné

# check_dyn_sep_no_ref
source: DynSeparator {0}: No ParameterRef selected
de: DynSeparator {0}: Kein ParameterRef ausgewählt
fr: DynSeparator {0}: Pas de ParameterRef sélectionné

# check_dyn_sep_uihint
source: DynSeparator {0}: UIHint is supported in Namespace 14 or later
de: DynSeparator {0}: UIHint wird erst ab Namespace 14 unterstützt
fr: DynSeparator {0}: L'option UIHint est supportée à partir de Namespace 14 ou +

# check_dyn_sep_no_icon
source: DynSeparator {0}: No Icon selected
de: DynSeparator {0}: Kein Icon ausgewählt
fr: DynSeparator {0}: Pas d'icône sélectionnée

# check_dyn_assign_no_target
source: DynAssign {0}: No Target selected
de: DynAssign {0}: Keine Quelle ausgewählt
fr: DynAssign {0}: Pas de cible sélectionnée

# check_dyn_assign_no_source
source: DynAssign {0}: No SourceTarget or Value set
de: DynAssign {0}: Keine Quelle oder Wert angegeben
fr: DynAssign {0}: Pas de source ou de valeur définies

# check_dyn_btn_no_name
source: DynButton {0}: Name was not set
de: DynButton {0}: Name wurde nicht angegeben
fr: DynButton {0}: Le nom n'est pas défini

# check_dyn_btn_no_ref
source: DynButton {0}: No ParameterRef selected
de: DynButton {0}: Kein ParameterRef ausgewählt
fr: DynButton {0}: Pas de ParameterRef sélectionné

# check_dyn_btn_no_icon
source: DynButton {0}: No Icon selected
de: DynButton {0}: Kein Icon ausgewählt
fr: DynButton {0}: Pas d'icône sélectionnée

# check_com_lang_text
source: {0} {1} ({2}): No translation for text {3}
de: {0} {1} ({2}): Keine Übersetzung für Text {3}
fr: {0} {1} ({2}): Pas de traduction pour {3}

# check_com_lang_functext
source: {0} {1} ({2}): No translation for functiontext {3}
de: {0} {1} ({2}): Keine Übersetzung für FunktionsText {3}
fr: {0} {1} ({2}): Pas de traduction pour la functiontext {3}

# main_export_error
source: KnxProd could not be published
de: KnxProd konnte nicht veröffentlicht werden
fr: Le fichier knxprod ne peut être créé

# main_export_success
source: KnxProd was successfully created
de: KnxProd wurde erfolgreich erstellt
fr: Le fichier knxprod a été créé avec succès

# main_export_error_namespace
source: Namespace /{0} can't be build on this system
de: Namespace {0} kann auf diesem System nicht erstellt werden
fr: Namespace /{0} Ne peut pas construire cet appareil

# main_export_error_prod_namespace
source: KnxProd can't contain different namespaces
de: KnxProd kann nicht verschiedene Namespaces enthalten
fr: Un fichier knxprod ne peut contenir différents namespaces (version de ETS)

# main_export_create
source: Creating KnxProd
de: Erstelle KnxProd
fr: Créer le fichier knxprod

# main_export_checked
source: Passed Check
de: Überprüfung bestanden
fr: Vérification faite

# main_export_failed
source: Build failed. Errors occurred
de: Erstellen fehlgeschlagen. Es traten Fehler auf
fr: Construction a échouée. Il y a des erreurs.

# update_error
source: Could not check for latest version
de: Es konnte nicht nach einer neuen Version suchen werden
fr: Vérification d'une nouvelle version impossible

# check_open_noprefix
source: OpenKnxModule {0}: Prefix is not set
de: OpenKnxModul {0}: Prefix wurde nicht gesetzt
fr: Le préfix OpenKnxModule {0}: n'est pas défini

# check_mod_noprefix
source: Module {0}: Prefix is not set
de: Modul {0}: Prefix ist nicht gesetzt
fr: Module {0}: Préfix non défini

# check_ver_union_size
source: Union {0}: Parameter {1} ({2}) does not fit in
de: Union {0}: Parameter {1} ({2}) ist zu groß
fr: Union {0}: Le Parameter {1} ({2}) ne convient pas

# check_ver_mod_paraoff_null
source: Module {0}: ParameterBaseOffset Argument is null
de: Modul {0}: ParameterBaseOffset Argument wurde nicht angegeben

# check_ver_mod_combase_null
source: Module {0}: ComObjectBaseNumber Argument is null
de: Modul {0}: ComObjectBaseNumber wurde nicht angegeben

# check_ver_loadprod_empty
source: Loadprocedure: Procedure is empty
de: Ladeprozedur: Prozedur ist leer

# check_ver_loadprod_failed
source: Loadprocedure: Parsing failed, no valid xml
de: Ladeprozedur: Xml ist nicht korrekt

# check_dyn_dr_pararef_null
source: DynRepeat {0}: ParameterRef is null
de: DynRepeat {0}: Es wurde kein ParameterRef angegeben

# check_dyn_dr_type
source: DynRepeat {0}: ParameterType of ParameterRef has to be Enum or NumberUInt
de: DynRepeat {0}: ParameterType des ParameterRefs muss Enum oder NumberUInt sein

# import_multiple_applications
source: Import: Hardware contains more than one application. Only the first one will be imported.
de: Import: Hardware enthält mehr als eine Applikation. Es wird nur die erste importiert.

# openknx_modules_duplicate
source: An OpenKnxModule with the same name '{0}' already exists.
de: Ein OpenKnxModule mit dem Namen '{0}' existiert bereits.

# openknx_modules_ofm
source: The OpenKnxModule is not an OFM or OGM.
de: Das OpenKnxModul ist kein OFM oder OGM.

# openknx_modules_remove
source: This Module is a OpenKnxModule. To remove it, delete the OpenKnxModule
de: Dieses Modul ist ein OpenKnxModul. Um es zu löschen, muss das OpenKnxModul gelöscht werden.

# check_ver_mem_not_unique
source: There are more than one MemorySections with address/offset '{0}'
de: Es existiert mehr als ein Speichersegment mit Adresse/Offset '{0}'

# check_app_number
source: The AppNumber cant be higher then 0xFFFF. Was reset to 0.
fr: Le numéro d'application ne peut pas être supérieur à 0xFFFF. Il a été réinitialisé à 0.
