Repository: OpenKNX/Kaenx-Creator
Catalog: Kaenx.Creator/Properties/Messages.*.resx
Languages: de, fr

# global_exception
source: Please save your project and restart the application.
de: Bitte speichern Sie ihr Projekt und starten Sie die Anwendung neu.
fr: Sauvegarder votre projet et redémarrer l'application.

# global_exception_title
source: Error
de: Fehler
fr: Erreur

# update_new
source: A new version is available: v{0} Wanna checkout github releases?
de: Es ist eine neue Version verfügbar: v{0}. Jetzt zu den Github Releases gehen?
fr: Une nouvelle version est disponible: v{0}\r\nVous voulez vérifier les versions sur Github ?

# update_title
source: Searching for update
de: Update suchen
fr: Vérification des mises à jour

# update_uptodate
source: You already use the latest version: v{0}
de: Sie verwenden bereits die neueste version: v{0}
fr: Vous utilisez déjà la dernière version : v{0}

# message_prompt_id
source: New Message ID
de: Neue Nachricht ID
fr: Nouveau Message ID

# prompt_id
source: ID Manuel
de: ID Manuell

# prompt_error
source: Please insert an integer.
de: Bitte geben Sie eine Ganzzahl ein.
fr: Merci de saisir un entier.

# prompt_error_title
source: Input error
de: Eingabefehler
fr: Erreur de saisie

# prompt_double
source: The ID {0} is already used by {1}.
de: Die Id {0} wird bereits von {1} verwendet.
fr: L'ID {0} est déjà utilisé par {1}.

# prompt_double_title
source: Duplicate ID
de: Doppelte ID
fr: ID existant

# prompt_auto_error
source: The element already has the first free ID.
de: Das Element hat bereits die erste freie ID
fr: Cet élément a déjà le premier ID disponible.

# prompt_auto_error_title
source: Automatic ID
de: Automatische ID
fr: ID automatique

# baggage_delete_error
source: The baggage is being referenced by {0} ParameterTypes. Delete it anyway?
de: Der Anhang wird von dem ParameterType {0} verwendet. Trotzdem löschen?
fr: Le baggage est référencé par {0} ParameterTypes.\r\nVoulez-vous le supprimer ?

# baggage_delete_error_title
source: Delete Baggage
de: Anhang löschen
fr: Supprimer le Baggage

# baggage_change_title
source: Edit Baggage
de: Anhang ändern
fr: Editer le Baggage

# baggage_change_success
source: Baggage was successfully changed
de: Anhang wurde erfolgreich geändert
fr: Le Baggage a été supprimé avec succès

# baggage_change_filter
source: Pictures
de: Bilder
fr: Images

# baggage_add_title
source: Add Baggage
de: Anhang hinzufügen
fr: Ajouter un Baggage

# baggage_import_title
source: Import Baggage
de: Anhänge importieren
fr: Importer des Baggages

# baggage_import_filter
source: Baggage File
de: Baggage Datei
fr: Fichier Baggage

# baggage_import_prompt
source: Delete existing baggages?
de: Vorhandene Anhänge löschen?
fr: Supprimer le Baggage existant ?

# baggage_export_title
source: Export Baggage
de: Anhang exportieren
fr: Exporter les Baggages

# baggage_export_filter
source: Baggage File
de: Anhang Datei
fr: Fichier Baggage

# viewer_get_title
source: Get Value
de: Wert abfragen
fr: Récupérer la valeur

# viewer_get_prompt
source: Id of the Parameter:
de: Id des Parameters:
fr: Id de Paramètre :

# viewer_get_inactive
source: Parameter with Id {0} is not visible.
de: Parameter mit der Id {0} ist aktuell nicht sichtbar.
fr: Le paramètre avec l'ID {0} n'est visible.

# viewer_get_value
source: Parameter with Id {0} has the value: {1}
de: Parameter mit der Id {0} hat den Wert: {1}
fr: Le paramètre avec l'ID {0} a pour valeur : {1}

# viewer_get_error
source: There is no Parameter with Id {0}.
de: Es wurde kein Parameter mit der Id {0} gefunden.
fr: Il n'y a pas de paramètre avec l'ID {0}.

# viewer_logger
source: Parameter changed: ID={0} Wert={1}
de: Parameter geändert: ID={0} Wert={1}
fr: Paramètre mis à jour : ID={0} Valeur={1}

# memcalc_para
source: Parameter '{0}' is outside of the memory boundaries.
de: Parameter '{0}' liegt außerhalb des Speichers
fr: L paramètre '{0}' est en dehors des limites de la mémoire.

# memcalc_union
source: Union '{0}' is outside of the memory boundaries.
de: Union '{0}' liegt außerhalb des Speichers
fr: L'Union '{0}' est en dehors des limites de la mémoire.

# memcalc_title
source: Assignment of memory space error
de: Speicherbelegung Fehler
fr: Erreur d'allocation mémoire

# comref_delete
source: This ComObjectRef is used in dynamic at least once. Continue?
de: Das ComObjectRef wird bereits im Dynamic verwendet. Wollen Sie es wirklich löschen?
fr: Cet ComObjectRef est utilisé dans la vue dynamique au moins une fois. Voulez-vous continuer ?

# comref_delete_title
source: Delete ComObjectRef
de: ComObjectRef löschen
fr: Supprimer le ComObjectRef

# comref_prompt_id
source: New ComObjectRef ID
de: Neue ComObjectRef Id
fr: Nouveau ComObjectRef ID

# com_delete1
source: This ComObject is used in dynamic at least one. Continue?
de: Das ComObject wird bereits im Dynamic verwendet. Wollen Sie es wirklich löschen?
fr: Cet ComObject est utilisé dans la vue dynamique au moins une fois. Voulez-vous continuer ?

# com_delete2
source: This ComObject is used by a ComObjectRef at least one. Continue?
de: Das ComObject wird von mindestens einem ComObjectRef verwendet. Wollen Sie es wirklich löschen?
fr: Cet ComObject est utilisé par un ComObjectRef au moins une fois. Voulez-vous continuer ?

# com_delete_title
source: Delete ComObject
de: ComObject löschen
fr: Supprimer le ComObject

# com_prompt_id
source: New ComObject ID
de: Neue ComObject Id
fr: Nouveau ComObject ID

# para_delete1
source: This Parameter is used in dynamic at least one. Continue?
de: Der Parameter wird bereits im Dynamic verwendet. Wollen Sie ihn wirklich löschen?
fr: Ce Parameter est utilisé dans la vue dynamique au moins une fois. Voulez-vous continuer ?

# para_delete2
source: This Parameter is used by a ParameterRef at least one. Continue?
de: Der Parameter wird bereits von mindestens einem ParameterRef verwendet. Wollen Sie ihn wirklich löschen?
fr: Ce Parameter est utilisé par un ParameterRef au moins une fois. Voulez-vous continuer ?

# para_delete_title
source: Delete Parameter
de: Parameter löschen
fr: Supprimer le Parameter

# para_prompt_id
source: New Parameter ID
de: Neue Parameter Id
fr: Nouveau Parameter ID

# pararef_delete
source: This ParameterRef is used in dynamic at least one. Continue?
de: Der ParameterRef wird bereits im Dynamic verwendet. Wollen Sie ihn wirklich löschen?
fr: Ce ParameterRef est utilisé dans la vue dynamique au moins une fois. Voulez-vous continuer ?

# pararef_delete_title
source: Delete ParameterRef
de: ParameterRef löschen
fr: Supprimer le ParameterRef

# pararef_prompt_id
source: New ParameterRef ID
de: Neue ParameterRef Id
fr: Nouveau ParameterRef ID

# dyn_copy_error
source: You have to cut an item before.
de: Sie müssen vorher ein Element ausschneiden.
fr: Vous devez couper un élément avant.

# dyn_copy_error_title
source: Paste item
de: Element einfügen
fr: Coller l'élément

# icon_delete_error
source: The icon is being referenced by {0} Item(s). Delete it anyway?
de: Das Icon wird von dem ParameterType {0} verwendet. Trotzdem löschen?
fr: Cette icône est référencée par {0} ParameterType(s).\r\nSupprimer?

# icon_delete_error_title
source: Delete Icon
de: Icon löschen
fr: Supprimer l'icône

# icon_change_title
source: Edit Icon
de: Icon bearbeiten
fr: Éditer l'icône

# icon_change_success
source: Icon was successfully changed
de: Icon wurde erfolgreich geändert
fr: L'icône a été modifiée avec succès

# icon_change_filter
source: Pictures
de: Bilder
fr: Images

# icon_add_title
source: Add Icon
de: Icon hinzufügen
fr: Ajouter une icône

# icon_import_title
source: Import Icons
de: Icons importieren
fr: Importer des icônes

# icon_import_filter
source: Icon File
de: Icon Datei
fr: Fichier de l'icône

# icon_import_prompt
source: Delete existing icons?
de: Bereits vorhandene Icons löschen?
fr: Supprimer les icônes existantes ?

# icon_export_title
source: Export Icons
de: Icons exportieren
fr: Exporter les icônes

# icon_export_filter
source: Icons File
de: Icon Datei
fr: Fichier de l'icône

# prodv_no_mod
source: No Module
de: Kein Modul
fr: Pas de modules

# checkv_not_used
source: Following items are not in use:
de: Folgende Elemente werden nicht verwendet:
fr: Ces éléments ne sont pas utilisés :

# checkv_delete
source: Delete all items until there are no unused items left?
de: Alle nicht verwendeten Elemente rekursiv löschen?
fr: Supprimer tous les éléments qui ne sont pas utilisés ?

# checkv_delete_title
source: Clean with removing
de: Bereinigen mit löschen
fr: Nettoyer avec suppression

# checkv_deleted
source: Following items were removed:
de: Folgende Elemente wurden gelöscht:
fr: Ces éléments ont été supprimés :

# checkv_warnings
source: Ignore warnings?
de: Warnungen ignorieren?
fr: Ignorer les avertissements ?

# checkv_warnings_title
source: Check application version
de: Überprüfe Applikationsversion
fr: Vérifier la version de l'application

# checkv_started
source: Started check
de: Überprüfung gestartet
fr: Vérification démarrée

# checkv_fin
source: Finished check
de: Überprüfung abgeschlossen
fr: Vérification finie

# main_def_cat
source: Main Category (will not be exported)
de: Hauptkategorie (wird nicht exportiert)
fr: Catégorie racine (ne sera pas exportée)

# main_empty_dpt
source: Empty DatapointType (only for ComObjectRefs)
de: Leerer DatapointType (nur für ComObjectRefs)
fr: DatapointType vide (seulement pour les ComObjectRefs)

# main_add_hard_error
source: Please select an application.
de: Bitte wählen Sie eine Applikation aus.
fr: Sélection une application.

# main_add_hard_error_title
source: Add Hardware failed
de: Hardware konnte nicht hinzugefügt werden
fr: L'ajout du Hardware a échoué

# main_lang_select
source: Please select a language.
de: Bitte wählen Sie eine Sprache aus.
fr: Veuillez sélectionner une langue.

# main_lang_add_error
source: Language is already supported.
de: Sprache wird bereits unterstützt.
fr: Cette langue est déjà supportée.

# main_project_save_title
source: Save Project
de: Projekt speichern
fr: Enregistrer le projet

# main_project_filter
source: Kaenx Manufacturer Project
de: Kaenx Hersteller Projekt
fr: Constructeur de projets Kaenx

# main_save_template
source: Name of the template:
de: Name des Templates:
fr: Nom du modèle :

# main_save_template_title
source: New Template
de: Neues Template
fr: Nouveau modèle

# main_save_template_empty
source: Please insert a name.
de: Bitte geben Sie einen Namen ein.
fr: Saisir un nom.

# main_save_template_duplicate
source: There is already a template with name '{0}'. Overwrite it?
de: Ein Template mit dem Namen '{0}' ist bereits vorhanden. Wollen Sie es überschreiben?
fr: Il existe un modèle avec le nom '{0}'. L'écraser ?

# main_project_open_title
source: Open Project
de: Projekt öffnen
fr: Ouvrir un projet

# main_project_open_format
source: Other Fileformat
de: Anderes Dateiformat
fr: Autres formats de fichiers

# main_project_open_old
source: The project was created with an older version. Wanna try to convert it?
de: Das Projekt wurde mit einer älteren Version erstellt. Soll versucht werden sie zu öffnen?
fr: Ce projet a été créé avec une ancienne version. Voulez-vous le convertir ?

# main_project_open_new
source: The project was created with a newer version and can't be opened.
de: Das Projekt wurde mit einer neueren Version erstellt und kann nicht geöffnet werden.
fr: Ce projet a été créé avec une version plus récente et ne peut être ouvert.

# main_project_open_error
source: The project can't be read. Maybe it needs to be converted first.
de: Das Projekt kann nicht gelesen werden. Eventuell muss es vorher konvertiert werden.
fr: Le projet ne peut être lu. Peut-être faut-il le convertir.

# main_project_open_error2
source: Due to the new fileformat the following hardware needs to readd apps:
de: Aufgrund des neuen Dateiformats können folgende Hardware nicht mehr die Applikationen zugeordnet werden:
fr: A cause du nouveau format, il faut ré-ajouter les applications au matériel suivant :

# main_def_category
source: New Category
de: Neue Kategorie
fr: Nouvelle catégorie

# main_export_duplicate
source: There is already a file called '{0}'. Overwrite it?
de: Es gibt bereits eine Datei mit dem Namen '{0}'. Soll diese überschrieben werden?
fr: Il existe un fichier avec le nom '{0}'. L'écraser ?

# main_export_title
source: Export knxprod
de: KnxProd exportieren
fr: Exporter le knxprod

# paratype_delete
source: This ParameterType is used by a Parameter at least one. Continue?
de: Der ParameterType wird von mindestens einem Parameter verwendet. Trotzdem löschen?
fr: Ce ParameterType est utilisé par un paramètre au moins une fois. Voulez-vous continuer ?

# paratype_delete_title
source: Delete ParameterType
de: ParameterType löschen
fr: Supprimer le ParameterType

# check_no_app
source: No Application was selected
de: Es wurde keine Applikation ausgewählt
fr: Pas d'application sélectionnée

# check_start
source: Starting check
de: Überprüfung wird gestartet
fr: Démarrage de la vérification

# check_cat_sub
source: Catalog has to have one subcategory
de: Katalog muss mindestens eine Unterkategorie haben
fr: Un catalogue doit avoir une sous catégorie

# check_manu_id
source: Invalid ManufacturerId: {0}
de: Ungültige HerstellerId: {0}
fr: ManufactureID invalide : {0}

# check_hard
source: Checking Hardware
de: Überprüfe Hardware
fr: Vérification du matériel

# check_hard_no_physicaladdress
source: Hardware has option HasIndividualAddress not checked
de: Hardware hat nicht die Option für eine Individuelle Adresse ausgewählt

# check_hard_no_app
source: Hardware has option HasApplicationprogram not checked
de: Hardware hat nicht die Option für das Applikationsprogramm ausgewählt

# check_hard_no_app2
source: Hardware has option HasApplicationprogram2 checked but not HasApplicationprogram
de: Hardware hat die Option für Applikationsprogramm2 ausgewählt, allerdings nicht für Applikationsprogramm

# check_app
source: Checking Applications
de: Überprüfe Applikationen
fr: Vérification des applications

# check_app_openknx
source: Application '{0}' is an OpenKnx project. Its number can't be greater than FF
de: Applikation '{0}' ist ein OpenKnx Projekt. Die Nummer kann somit nicht größer als FF sein
fr: L'application '{0}' est un projet OpenKnx. Son numéro ne peut être plus élevé que FF

# check_baggage_no_target
source: Baggage '{0}' has no target
de: Anhang '{0}' hat kein Zielpfad
fr: Le Baggage '{0}' n'a pas de destination

# check_ver
source: Checking Application {0}
de: Überprüfe Applikation {0}

# check_end
source: Finished Check
de: Überprüfung abgeschlossen
fr: Vérification finie

# check_ver_mediumtypes
source: MediumTypes are not set. Delete Data/maskversion.jso and restart application
de: MediumTypes wurde nicht gesetzt. Bitte löschen Sie die Datei Data/maskversion.json und starten Sie die Applikation neu
fr: Le MediumType n'est pas défini. Supprimer le fichier Data/maskversion.json et redémarrer l'application

# check_ver_modules
source: ModuleDefines are supported in Namespace 20 or later
de: ModuleDefines werden erst ab Namespace 20 unterstützt
fr: Les ModulesDefines sont supportées à partir de Namespace 20 ou +

# check_ver_messages
source: Messages are supported in Namespace 14 or later
de: Nachrichten werden erst ab Namespace 14 unterstützt
fr: Les Messages sont supportés à partir de Namespace 14 ou +

# check_ver_loadprod
source: Version has to have a loadprocedure
de: Version muss über eine Ladeprozedur verfügen
fr: La version doit avoir une procédure de chargement

# check_ver_helptext
source: Helptexts are supported in Namespace 14 or later
de: Hilfetexte werden erst ab Namespace 14 unterstützt
fr: Les Helptexts sont supportés à partir de Namespace 14 ou +

# check_ver_loadprod_size
source: Loadprocedure {0}: Memory size does not match
de: Ladeprozedur {0}: Speichergröße stimmen nicht überein
fr: La procédure de chargement {0}: La taille mémoire ne correspond pas

# check_ver_parat_checkbox
source: ParameterType Number {0} ({1}): If UIHint is Checkbox minimum has to be 0 and maximum 1
de: ParameterType Number {0} ({1}): Wenn bei UIHint Checkbox ausgewählt wurde, muss minimum 0 und maximum 1 sein
fr: Le numéro de ParameterType {0} ({1}): Si la case UIHint est cochée, le minimum doit être 0 et le maximum 1

# check_ver_parat_text
source: ParameterType Text {0} ({1}): Size {2} is not a multiple of 8
de: ParameterType Text {0} ({1}): Größe {2} ist kein Vielfaches von 8
fr: Le ParameterType texte {0} ({1}): La taille {2} n'est pas un multiple de 8

# check_ver_parat_enum
source: ParameterType Enum {0} ({1}): Value {2} is used more than once
de: ParameterType Enum {0} ({1}): Wert {2} wird mehrmals verwendet
fr: Le ParameterType énumération {0} ({1}): La valeur {2} est utilisée plus d'une fois

# check_ver_parat_enum2
source: ParameterType Enum {0} ({1}): Value {2} is greater than the maximum {3}
de: ParameterType Enum {0} ({1}): Wert {2} ist größer als das Maximum {3}
fr: Le ParameterType énumération {0} ({1}): La valeur {2} est plus grande que le max {3}

# check_ver_parat_enum_translation
source: ParameterType Enum {0}/{1} ({2}): Is not translated in {3}
de: ParameterType Enum {0}/{1} ({2}): Wurde nicht in {3} übersetzt
fr: Le ParameterType énumération {0}/{1} ({2}): n'est traduit en {3}

# check_ver_parat_enum_icon
source: ParameterType Enum {0}/{1} ({2}): No icon selected
de: ParameterType Enum {0}/{1} ({2}): Kein Icon ausgewählt
fr: Le ParameterType énumération {0}/{1} ({2}): Pas d'icône sélectionnée

# check_ver_parat_int_progbar
source: ParameterType {0} {1} ({2}): Progressbar is supported in Namespace 20 or later
de: ParameterType {0} {1} ({2}); Progressbar wird erst ab Namespace 20 unterstützt
fr: Le ParameterType {0} {1} ({2}): La barre de progression est supportée à partir de Namespace 20 ou +

# check_ver_parat_int_max
source: ParameterType {0} {1} ({2}): Maximum is no integer
de: ParameterType {0} {1} ({2}): Maximum ist keine Ganzzahl
fr: ParameterType {0} {1} ({2}): Le maximum n'est pas un entier

# check_ver_parat_int_min
source: ParameterType {0} {1} ({2}): Minimum is no integer
de: ParameterType {0} {1} ({2}): Minimum ist keine Ganzzahl
fr: ParameterType {0} {1} ({2}): Le minimum n'est pas un entier

# check_ver_parat_int_offset
source: ParameterType {0} {1} ({2}): Display Offset is no integer
de: ParameterType {0} {1} ({2}): Anzeige Offset ist keine Ganzzahl
fr: ParameterType {0} {1} ({2}): L'offset d'affichage n'est ps un entier

# check_ver_parat_int_factor
source: ParameterType {0} {1} ({2}): Display Factor is no integer
de: ParameterType {0} {1} ({2}): Anzeige Faktor ist keine Ganzzahl
fr: ParameterType {0} {1} ({2}): Le facteur d'affichage n'est pas un entier

# check_ver_parat_name_duplicate
source: ParameterType: The name '{0}' is used {1}x times. Names have to be unique
de: ParameterType: Der Name '{0}' wurde {1}x verwendet. Namen müssen einzigartig sein

# check_ver_parat_size
source: ParameterType {0} {1} ({2}): SizeInBit should not be greater than 64
de: ParameterType {0} {1} ({2}): SizeInBit darf nicht größer als 64 sein

# check_ver_parat_uint_min2
source: ParameterType {0} {1} ({2}): Min can't be smaller than 0
de: ParameterType {0} {1} ({2}): Min kann nicht kleiner als 0 sein
fr: ParameterType {0} {1} ({2}): Le minimum ne peut être inférieur à 0

# check_ver_parat_int_minmax
source: ParameterType {0} {1} ({2}): Min is greater than max
de: ParameterType {0} {1} ({2}): Minimum ist größer als das Maximum
fr: ParameterType {0} {1} ({2}): Le minimum ne peut être plus grand que le maximum

# check_ver_parat_int_max2
source: ParameterType {0} {1} ({2}): Max can't be greather than {3}
de: ParameterType {0} {1} ({2}): Maximum kann nicht größer als {3} sein
fr: ParameterType {0} {1} ({2}): Le maximum ne

# check_ver_parat_int_min2
source: ParameterType Int {0} ({1}): Minimum can't be smaller than {2}
de: ParameterType Int {0} ({1}): Minimum kann nicht kleiner als {2} sein
fr: ParameterType entier {0} ({1}): Le minimum ne peut être plus petit que {2}

# check_ver_parat_float
source: ParameterType Float {0} ({1}): There is no check yet
de: ParameterType Float {0} ({1}): Aktuell keine Überprüfung verfügbar
fr: ParameterType nombre flottant {0} ({1}): Il n'y a pas encore de test

# check_ver_parat_picture
source: ParameterType Picture {0} ({1}): No Baggage selected
de: ParameterType Picture {0} ({1}): Kein Anhang ausgewählt
fr: ParameterType image {0} ({1}): Pas de Baggage de sélectionné

# check_ver_parat_none
source: ParameterType None {0} ({1}): Supported in ETS3. Activate option IsPreETS4
de: ParameterType None {0} ({1}): Unterstützt in ETS3. Aktivieren Sie die Option IsPreETS4
fr: ParameterType None {0} ({1}): Supporté dans ETS3. Activer l'option IsPreETS4

# check_ver_parat_color1
source: ParameterType Color {0} ({1}): Not supported colorspectrum {2}
de: ParameterType Color {0} ({1}): Nicht unterstützter Farbspektrum {2}
fr: ParameterType couleur {0} ({1}): Spectre de couleur non supporté{2}

# check_ver_parat_color2
source: ParameterType Color {0} ({1}): RGBW is supported in Namespace 20 or later
de: ParameterType Color {0} ({1}): RGBW wird erst ab Namespace 20 unterstützt
fr: ParameterType couleur {0} ({1}): RGBW est supporté avec le Namespace 20 ou +

# check_ver_parat_ip1
source: ParameterType IpAddress {0} ({1}): No AddressType selected
de: ParameterType IpAddress {0} ({1}): Kein AddressType ausgewählt
fr: ParameterType adresse IP {0} ({1}): Aucun type d'adresse sélectionné

# check_ver_parat_ip2
source: ParameterType IpAddress {0} ({1}): No IP Protocol selected
de: ParameterType IpAddress {0} ({1}): Kein IP-Protokoll ausgewählt
fr: ParameterType adresse IP {0} ({1}): Aucun protocole IP sélectionné

# check_ver_parat_date
source: ParameterType Date {0} ({1}): No encoding selected
de: ParameterType Date {0} ({1}): Kein Encoding ausgewählt
fr: ParameterType date {0} ({1}): Aucun encodage sélectionné

# check_ver_parat_unknown
source: Unknown ParameterType for {0} ({1})
de: Unbekannter ParameterType für {0} ({1})
fr: ParameterType inconnu {0} ({1})

# check_ver_loadprod_msg
source: Loadprocedure: Messages are being used but the option is not active
de: Ladeprozedur: Nachrichten werden verwendet, wurden allerdings nicht aktiviert
fr: Procédure de chargement : Les messages sont utilisés mais l'option est inactive

# check_ver_loadprod_msgref
source: Loadprocedure: MessageRef is not an integer and there is no message with name {0}
de: Ladeprozedur: MessageRef ist keine Ganzzahl und es gibt keine Meldung mit dem Namen {0}
fr: Procédure de chargement : MessageRef n'est pas un entier

# check_ver_loadprod_msgref_error
source: Loadprocedure: MessageRef references to a not existing UId ({0})
de: Ladeprozedur: MessageRef verweist auf eine nicht existierende UId ({0})
fr: Procédure de chargement : MessageRef référence un UID inexistant ({0})

# check_ver_cat_number
source: Catalog {0}: Sectionnumber is empty
de: Katalog {0}: Sektionsnummer ist leer
fr: Catalogue {0}: Le numéro de section est vide

# check_ver_cat_prodnumber
source: Catalog {0}: Productnumber is not an integer
de: Katalog {0}: Produktnummer ist keine Ganzzahl
fr: Catalogue {0}: Le numéro de produit n'est pas un entier

# check_ver_cat_hardware
source: Catalog {0}: No hardware is selected
de: Katalog {0}: Keine Hardware ausgewählt
fr: Catalogue {0}: Aucun matériel sélectionné

# check_ver_mod_allocs
source: Module {0}: Allocators are supported in Namespace 20 or later
de: Modul {0}: Allokatoren werden erst ab Namespace 20 unterstützt
fr: Module {0}: les Allocators sont supportés à partir de Namespace 20 ou +

# check_ver_mod_paraoff
source: Module {0}: ParameterBaseOffset Argument is not of type numeric
de: Modul {0}: ParameterBaseOffset Argument ist nicht vom Typ Numeric
fr: Module {0}: L'argument ParameterBaseOffset n'est pas de type numérique
