Repository: OpenKNX/Kaenx-Creator
Catalog: Kaenx.Creator/Properties/Resources.*.resx
Languages: de, fr

# menu_impo
source: Import
de: Importieren
fr: Importer

# menu_impo_ets
source: ETS Product database
de: ETS Produktdatenbank
fr: Base de données produit

# menu_lang
source: Language
de: Sprache/Language
fr: Langue

# menu_lang_default
source: System Settings
de: Systemeinstellung
fr: Paramètres système

# menu_proj
source: Project
de: Projekt
fr: Projet

# menu_proj_close
source: Close
de: Schließen
fr: Fermer

# menu_proj_new
source: New
de: Neu
fr: Nouveau

# menu_proj_open
source: Open
de: Öffnen
fr: Ouvrir

# menu_proj_save
source: Save
de: Speichern
fr: Enregistrer

# tabs_cat
source: Catalog
de: Katalog
fr: Catalogue

# tabs_gen
source: General
de: Allgemeines
fr: Paramètres généraux

# tabs_pub
source: Publish
de: Veröffentlichen
fr: Publier

# tabs_bagg
source: Attachments
de: Anhänge
fr: Fichiers complémentaires

# menu_save_template
source: Save as template
de: Speichern als Vorlage
fr: Enregistrez comme nouveau modèle

# menu_save_as
source: Save as
de: Speichern unter
fr: Enregistrer sous

# menu_save
source: Save
de: Speichern
fr: Enregistrer

# menu_temp_empty
source: Empty
de: Leer
fr: Vide

# menu_info_vers
source: Show version
de: Version anzeigen
fr: Afficher la version

# tgen_manu
source: Manufacturer ID
de: Hersteller Id
fr: ID Fabricant

# tgen_name
source: Project Name
de: Projekt Name
fr: Nom du projet

# gen_edit
source: Edit
de: Bearbeiten
fr: Editer

# gen_add
source: Add
de: Hinzufügen
fr: Ajouter

# gen_remove
source: Remove
de: Entfernen
fr: Supprimer

# tgen_lang_def
source: Default language
de: Standard Sprache
fr: Langue par défaut

# tcat_add_sub
source: Add Subcategory
de: Unterkategorie hinzufügen
fr: Ajouter une sous-catégorie

# prop_name
source: Name
fr: Nom

# prop_number
source: Number
de: Nummer
fr: Numéro

# tcat_iscat
source: Element is a category
de: Element ist eine Kategorie
fr: Cet élément est une catégorie

# gen_text
source: Text
fr: Texte

# gen_lang
source: Language
de: Sprache
fr: Langue

# gen_hard
source: Hardware
fr: Matériel

# gen_gen
source: General
de: Allgemein
fr: Général

# prop_serial
source: Serial Number
de: Seriennummer
fr: N ° de série

# prop_buscurrent
source: Bus Current
de: Busstrom
fr: Courant consommé

# prop_haspa
source: Device has a Physical Address
de: Gerät hat eine Physikalische Adresse
fr: Ce matériel possède une adresse physique

# prop_ispower
source: Device is a Power Supply
de: Gerät ist eine Spannungsversorgung
fr: Ce matériel possède une alimentation interne

# prop_iscoupler
source: Device is a coupler
de: Gerät ist ein Koppler
fr: Ce matériel est un coupleur de bus

# prop_ip
source: Device uses KNX/IPnet
de: Geräte kann KNX/IPnet
fr: Ce matériel utilise KNX/IPnet

# prop_hasapp
source: Device has an applicationprogram
de: Gerät hat ein Applikationsprogramm
fr: Ce matériel possède une application

# prop_hasapp2
source: Device has a second application program
de: Gerät hat ein zweites Applikationsprogramm
fr: Ce matériel possède une application secondaire

# prop_ordernumber
source: Order Number
de: Bestellnummer
fr: Numéro de commande

# prop_isreg
source: Device is for REG
de: Gerät ist REG
fr: Montage sur rail DIN

# gen_import
source: Import
de: Importieren
fr: Importer

# gen_export
source: Export
de: Exportieren
fr: Exporter

# bagg_error
source: This baggage is not used by a ParameterType
de: Dieses Baggage wird von keinem ParameterType verwendet
fr: Fichier complémentaire non utilisé par un ParameterType

# bagg_targetpath
source: Target Path
de: Zielpfad
fr: Chemin de destination

# bagg_file
source: Change File
de: Datei ändern
fr: Changer le fichier

# bagg_timestamp
source: Timestamp
de: Zeitstempel
fr: Horodatage

# prop_bcu
source: BCU
fr: Coupleur de bus (BCU)

# tapps_info
source: More information to application numbering
de: Mehr Informationen zum Nummerieren von Applikationen
fr: Plus d'info sur la numérotation des versions

# tapps_memory
source: Memory Type:
de: Speicherart:
fr: Type de mémoire:

# tapps_loadp
source: Load Procedure:
de: Ladeprozedur:
fr: Procédure de chargement:

# gen_copy
source: Copy
de: Kopieren
fr: Copier

# tapps_openv
source: Open in ProdViewer
de: Öffnen in ProdViewer
fr: Ouvrir dans ProdViewer

# tver_addrmem
source: Addresstable Memory:
de: Adresstabelle Speicher:
fr: Table d'occupation mémoire :

# tver_addroff
source: Addresstable Offset:
de: Adresstabelle Offset:
fr: Offset mémoire :

# tver_addrmax
source: Addresstable Max Entries:
de: Addresstabelle max. Einträge:
fr: Nombre d'entrées mémoire max :

# tver_assomem
source: Associationtable Memory:
de: Assoziationstabelle Speicher:
fr: Table d'association mémoire :

# tver_assooff
source: Associationtable Offset:
de: Assoziationstabelle Offset:
fr: Offset de la table d'association mémoire :

# tver_assomax
source: Associationtable Max Entries:
de: Assoziationstabelle max. Einträge:
fr: Nombre d'entrées max de la table d'association :

# tver_commem
source: ComObjectTable Memory:
de: Kommunikationsobjekttabelle Speicher:
fr: Mémoire des ComObjects :

# tver_comoff
source: ComObjectTable Offset:
de: Kommunikationsobjekttabelle Offset:
fr: Offset mémoire des ComObjects :

# prop_versreplace
source: Replaces following Versions:
de: Ersetzt folgende Versionen:
fr: Remplace les versions suivantes :

# prop_ns
source: Namespace Version
fr: Version du Namespace

# gen_langs
source: Languages
de: Sprachen
fr: Langue

# tabs_check
source: Verify
de: Überprüfen
fr: Vérifier

# tabs_mem
source: Memory
de: Speicher
fr: Mémoire

# vgen_autopara
source: Generate ParameterRefs automatically
de: ParameterRefs automatisch erstellen
fr: Générer automatiquement les ParamterRefs

# vgen_autocom
source: Generate ComObjectRefs automatically
de: ComObjectRefs automatisch erstellen
fr: Générer automatiquement les ComObjectRefs

# vgen_union
source: Activate Unions
de: Unions aktivieren
fr: Activer l'usage des Unions

# vgen_mods
source: Activate Modules
de: Module aktivieren
fr: Activer l'usage des Modules

# vgen_msg
source: Activate Messages
de: Meldungen aktivieren
fr: Activer l'usage des Messages

# prop_address
source: Address
de: Adresse
fr: Adresse

# prop_size
source: Size
de: Größe
fr: Taille

# vgen_autosize
source: Calculate size automatically
de: Größe automatisch berechnen
fr: Ajuster la taille automatiquement

# vgen_mautopara
source: Order Parameters/Unions/Modules automatically
de: Parameter/Unions/Module automatisch anordnen
fr: Organise automatiquement les Paramètres/Unions/Modules

# vgen_mautoorder
source: Order automatically even if they have an address
de: Automatisch anordnen, auch wenn sie bereits eine Adresse besitzen
fr: Organise automatiquement même s'ils possèdent une adresse

# vgen_heatmap
source: Calculate Heatmap
de: Heatmap berechnen
fr: Construire la représentation mémoire

# gen_reset
source: Reset
de: Zurücksetzen
fr: Réinitialiser

# tabs_paras
source: Parameter
fr: Paramètres

# tabs_loadp
source: LoadProcedures
de: Ladeprozedur
fr: Procédure de chargement

# tabs_dyn
source: Dynamic
de: Dynamisch
fr: Vue Dynamic

# tmod_pbo
source: ParameterBaseOffset:
fr: Offset de base des paramètres :

# tmod_cbn
source: ComObjectBaseNumber:
fr: Numéro de ComObject:

# tmod_autocbn
source: ComObjectBaseNumber will be calculated automatically
de: ComObjectBaseNumber automatisch berechnen
fr: Numéros de ComObject calculés automotiquement

# gen_filter
source: Filter/ID:
fr: Filtre ID :

# parat_error
source: This ParameterType is not used by a Parameter
de: Dieser ParameterTyp wird von keinem Parameter verwendet
fr: Ce ParameterType n'est pas utilisé par un Parameter

# parat_mansize
source: Manually size in bits
de: Manuelle Größe in Bits
fr: Saisie manuelle de la taille en bits

# prop_value
source: Value
de: Wert
fr: Valeur

# prop_trans
source: Translate
de: Übersetzen
fr: Traduire

# parat_add
source: Add Item
de: Aufzählung hinzufügen
fr: Ajouter un élément

# parat_increment
source: Increment
de: Erhöhen
fr: Incrément

# parat_uihint_none
source: None
fr: Aucun

# parat_uihint_slider
source: Slider
fr: Curseur

# parat_uihint_check
source: CheckBox
fr: Case à cocher

# parat_uihint_prog
source: ProgressBar
fr: Barre d'avancement

# parat_uihint_ha
source: HostAddress
fr: Adresse machine

# parat_uihint_ga
source: GatewayAddress
fr: Adresse de passerelle

# parat_uihint_ua
source: UnicastAddress
fr: Adresse Unicast

# parat_uihint_ba
source: BroadcastAddress
fr: Adresse de diffusion

# parat_uihint_ma
source: MulticastAddress
fr: Adfesse Multicast

# parat_uihint_sm
source: SubnetMask
fr: Masque de sous réseau

# uni_error
source: This union is not used by a parameter
de: Diese Union wird von keinem Parameter verwendet
fr: Cette union n'est pas utilisée par un ParameterType

# prop_sizebit
source: Size in bits
de: Größe in Bits
fr: Taille en bits

# prop_savepath
source: Save in
de: Speichern in
fr: Enregistrer dans

# prop_mem
source: Select memory
de: Speicher auswählen
fr: Sélectionner la mémoire utilisée

# prop_offsetbit
source: Bit Offset
fr: Bit de décalage

# uni_error2
source: Properties are not supported yet
de: Properties werden aktuell noch nicht unterstützt
fr: Propriétés pas encore supportées

# uni_addrauto
source: Address is set automatically
de: Adresse wird automatisch festgelegt
fr: Adresse configurée automatiquement

# prodv_text
source: Text
fr: Texte

# prodv_settings
source: Settings
de: Einstellungen
fr: Réglages

# prodv_value
source: Value
de: Wert
fr: Valeur

# prop_function
source: Function
de: Funktion
fr: Fonction

# prodv_getval
source: Get Parameter Value
de: Parameter Wert abfragen
fr: Obtenir la valeur du paramètre

# menu_info_debug
source: Activate Debug Messages
de: Aktiviere Debug Meldungen
fr: Activer le mode Debug

# tcheck_tooltip
source: Navigate directly to the element
de: Gehe direkt zu Element
fr: Aller directement à l'élément

# tcheck_check
source: Check
de: Überprüfen
fr: Vérifier

# tcheck_clean1
source: Mark not used elements
de: Nicht verwendete Elemente markieren
fr: Identifier les éléments non utilisés

# tcheck_clean2
source: Remove not used elements
de: Nicht verwendete Elemente entfernen
fr: Supprimer les éléments non utilisés

# gen_clone
source: Clone
de: Klonen
fr: Cloner

# gen_id_man
source: Manual
de: Manuell
fr: Manuel

# gen_id_auto
source: Automatically
de: Automatisch
fr: Automatique

# gen_id_reset
source: Reset
de: Zurücksetzen
fr: Réinitialiser

# tpara_error
source: This Parameter is not used by a ref
de: Der Parameter wird von keinem Ref verwendet
fr: Ce ParameterType n'est pas utilisé par un ParameterRef

# prop_suffix
source: Suffix
fr: Suffixe

# prop_access
source: Access
de: Zugriff
fr: Accès

# tpara_union
source: Union affiliation
de: Union zugehörigkeit
fr: Affiliation d'Union

# tpara_infoauto
source: Address is set automatically
de: Adresse wird automatisch festgelegt
fr: Adresse configurée automatiquement

# gen_onlydeflang
source: Export only the default language (no Translation-Unit)
de: Nur Standardsprache exportieren (keine Translation-Unit)
fr: Exporte seulement la langue par défaut

# tpara_error2
source: This ParameterRef is not used in dynamic
de: Dieser ParameterRef wird im Dynamic nicht verwendet
fr: Ce ParameterRef n'est pas utilisé dans la vue Dynamic

# prop_para
source: Parameter
fr: Paramètre

# prop_order
source: DisplayOrder
fr: Ordre d'affichage

# tcom_error
source: This ComObject is not used by a ref
de: Dieses KomObjekt wird von keinem Ref verwendet
fr: Ce ComObject n'est pas référencé par un ComObjectRef

# tcom_para
source: Text Parameter
fr: Paramètre du texte

# tcom_func
source: Functiontext
de: Funktionstext
fr: Texte de la fonction

# tcom_size
source: Object Size
de: Objekt Größe
fr: Taille de l'objet

# tcom_flag_com
source: Flag Communication
de: Flag Kommunikation
fr: Indicateurs de communication

# tcom_flag_read
source: Flag Read
de: Flag Lesen
fr: Lecture (read)

# tcom_flag_write
source: Flag Write
de: Flag Schreiben
fr: Écriture (write)

# tcom_flag_trans
source: Flag Transmit
de: Flag Übertragen
fr: Transmission

# tcom_flag_update
source: Flag Update
de: Flag Aktualisieren
fr: Actualisation (update)

# tcom_flag_oninit
source: Flag Read on Init
de: Flag Lesen bei Initialisierung
fr: Initialisation

# tcom_error2
source: This ComObjectRef is not used in dynamic
de: Dieses KomObjektRef wird im Dynamic nicht verwendet
fr: Ce ComObjectRef n'est pas utilisé dans la vue Dynamic

# prop_como
source: CommunicationObject
de: Kommunikationsobjekt
fr: Objet de communication

# tdyn_tmain
source: This Root-Node will not be exported and can therefor not be edited or removed.
de: Dieser Knotenpunkt wird nicht exportiert und kann somit nicht gelöscht oder geändert werden.
fr: Ce point de départ ne sera pas exporté et ne peut être édité ou supprimé.

# tdyn_tindchan
source: An Independent-Channel will not be displayed. All sub ParameterBlocks will be displayed without a channel.
de: Ein Independent Channel wird selbst nicht dargestellt. Die darunter liegenden Parameterblöcke werden direkt in der Ansicht angezeigt.
fr: Un Independant-Channel n'est pas affiché. Les ParamterBlocs sont affichables sans Channel.

# tdyn_troot
source: Root Node
de: Root Knoten
fr: Racine

# tdyn_pararef
source: Parameter Ref
fr: Référence du paramètre

# tdyn_paraname
source: Parameter Name
fr: Nom du paramètre

# tdyn_paracell
source: Cell (only ParameterBlock layout grid/table)
de: Zelle (nur bei ParameterBlock Layout Grid/Tabelle)
fr: Case (seulement pour placement en grille/table)

# tdyn_paratext
source: Parameter Text
fr: Texte du paramètre

# tdyn_parareftext
source: ParameterRef Text
fr: Texte de la référence du paramètre

# tdyn_comref
source: ComObject Ref
de: Kommunikationsobjekt Ref
fr: Référence de l'objet de communication

# tdyn_comname
source: ComObject Name
de: Kommunikationsobjekt Name
fr: Nom de l'objet de communication

# tdyn_comtext
source: ComObject Text
de: Kommunikationsobjekt Text
fr: Texte de l'objet de communication

# tdyn_comreftext
source: ComObjectRef Text
de: KommunikationsobjectRef Text
fr: Texte de la référence de l'objet de communication

# tdyn_pb_showtree
source: Show in ComObjectTree
de: In KomObjektBaum anzeigen
fr: Affiche l'arbre des objets de communication

# tdyn_pb_inline
source: Is InLine
de: Ist InLine
fr: En ligne

# tdyn_pb_layout
source: Layout
fr: Disposition

# tdyn_pb_cells
source: Cells
de: Spalten
fr: Colonnes

# tdyn_pb_rows
source: Rows
de: Reihen
fr: Lignes

# tdyn_pb_width
source: Width (in %)
de: Breite (in %)
fr: Largeur (%)

# tdyn_textpara
source: Text Parameter
fr: Paramètre du texte

# tdyn_ass_target
source: Target ParameterRef
de: Ziel ParameterRef
fr: ParameterRef cible

# tdyn_ass_source
source: Source ParameterRef
de: Quelle ParameterRef
fr: ParameterRef source

# tdyn_ass_value
source: Source Value
de: Quelle Wert
fr: Valeur Source

# tdyn_ass_warnign1
source: Warning! Set only Source Value OR Source ParameterRef.
de: ACHTUNG! Entweder Source Value ODER Source Parameter Ref angeben.
fr: Attention ! Choisissez soit une valeur OU un ParameterRef comme source.

# tdyn_ass_warning2
source: Source ParameterRef will be exported if value is empty
de: Wenn Value leer ist, wird Source Parameter Ref exportiert
fr: Si la valeur est vide, celle du ParameterRef source sera exporté

# tdyn_tblock
source: Block
fr: Bloc

# tdyn_tseparator
source: Separator
fr: Séparateur

# tdyn_tassign
source: Assign
fr: Affectation (Assign)

# tdyn_tmod
source: Module
de: Modul
fr: Modules

# tdyn_tselection
source: Selection
de: Auswahl
fr: Sélection

# tdyn_tpara
source: Parameter
fr: Paramètre

# tdyn_tcom
source: CO
de: KO
fr: ComObject

# gen_cut
source: Cut
de: Ausschneiden
fr: Couper

# gen_put
source: Insert
de: Einfügen
fr: Insérer

# gen_unfold
source: Unfold
de: Aufklappen
fr: Développer

# gen_collapse
source: Collapse
de: Zuklappen
fr: Refermer

# tdyn_add_ichan
source: Add Independent Channel
de: Independent Channel hinzufügen
fr: Ajouter un nouveau Channel indépendant

# tdyn_add_chan
source: Add Channel
de: Channel hinzufügen
fr: Ajouter un Channel

# tdyn_add_block
source: Add Block
de: Block hinzufügen
fr: Ajouter un bloc

# tdyn_add_mod
source: Add Module
de: Modul hinzufügen
fr: Ajouter Module

# tdyn_add_choose
source: Add Choose
de: Abfrage hinzufügen
fr: Ajouter une condition

# tdyn_add_para
source: Add Parameter
de: Parameter hinzufügen
fr: Ajouter un paramètre

# tdyn_add_com
source: Add ComObject
de: KO hinzufügen
fr: Ajouter un objet de communication

# tdyn_add_sepa
source: Add Separator
de: Separator hinzufügen
fr: Ajouter un séparateur

# tdyn_add_assign
source: Add Assign
de: Assign hinzufügen
fr: Ajouter d'une affectation

# tdyn_add_btn
source: Add Button
de: Button hinzufügen
fr: Ajouter un bouton

# tdyn_when_def
source: Show only if every other condition fails
de: Anzeigen, wenn alle anderen Bedingungen nicht erfüllt sind
fr: Montrer uniquement si les autres conditions échoues

# tdyn_when1
source: Equals: Value must be the same (Example: =4)
de: Gleich: Wert mit Istgleichzeichen davor (Beispiel: =4)
fr: Égale : les valeurs sont les mêmes (Exemple : =4)

# tdyn_when2
source: Not Equals: Put an exclamation mark in front (Example: !=4)
de: Ungleich: Wert mit Istgleich- und Ausrufezeichen davor (Beispiel: !=4)
fr: Différente : Mettre un point d'exclamation (Exemple : !=4)

# tdyn_when3
source: List: Split values with space (Example: 1 2 3)
de: Liste: Werte durch Leerzeichen getrennt. (Beispiel: 1 2 3)
fr: Liste : Valeurs séparées par des espaces (Exemple : 1 2 3)

# tdyn_when4
source: Greater than: > or >= (Example: >5)
de: Größer als: > oder >= (Beispiel: >5)
fr: Plus grand que : > or >= (Exemple: >5)

# tdyn_when5
source: Lower than: < or <= (Example: <=8)
de: Kleiner: < oder <= (Beispiel: <=8)
fr: Plus petit que : < or <= (Exemple: <=8)

# vgen_ets4
source: Is PreETS4
de: Ist PreETS4
fr: Format PreETS4

# tdyn_add_cond
source: Add Condition
de: Bedingung hinzufügen
fr: Ajouter une condition

# vgen_help
source: Activate Help
de: Hilfe aktivieren
fr: Activer l'aide

# tdyn_help
source: Helptext
de: Hilfetext
fr: Texte d'aide

# tabs_help
source: Helptexts
de: Hilfetexte
fr: Textes d'aide

# help_edit
source: Edit Helptext
de: Hilfetext bearbeiten
fr: Éditer le texte d'aide

# help_preview
source: Preview Helptext
de: Hilfetext Vorschau
fr: Prévisualiser le texte d'aide

# tapps_medium
source: Medium:
fr: Média :

# menu_info_help
source: Help
de: Hilfe
fr: Aide

# vgen_autoload
source: Add size in LoadProcedure automatically
de: In LadeProzedur automatisch Größe einfügen
fr: Ajouter la taille automatiquement dans la procédure de chargement

# tdyn_add_repeat
source: Repeat
fr: Répéter

# tdyn_trepe
source: Repeat
fr: Répéter

# prop_count
source: Count
de: Anzahl
fr: Nombre

# prop_start
source: Start
fr: Début

# tabs_alloc
source: Allocator
fr: Allocation (Allocator)

# tdyn_usealloc
source: Use Allocator
de: Allocator benutzen
fr: Utiliser une allocation (Allocator)

# tabs_icon
source: Icons
fr: Icônes

# parat_year
source: Display Year
de: Jahr anzeigen
fr: Afficher l'année

# parat_date
source: Encoding
fr: Encodage

# prop_icon
source: Icon
fr: Icône

# menu_info_check
source: Check for update
de: Nach Update suchen
fr: Rechercher les mises à jour

# menu_info_auto
source: Check for updates automatically on start
de: Beim Starten automatisch nach Updates suchen
fr: Vérifier automatiquement les mises à jour au démarrage.

# tdyn_tbutton
source: Button
fr: Bouton

# prop_handlerparas
source: EventHandler Parameter
fr: Paramètres du gestionnaire d'événements

# prop_offline
source: Offline
fr: Déconnecté

# prop_connless
source: Connection Less
fr: Sans connexion

# prop_connoriented
source: Connection Oriented
fr: Connexion orientée

# prop_online
source: Connection Type
de: Verbindungstyp
fr: Type de connexion

# parat_doffset
source: Display Offset
de: Anzeige Offset
fr: Décalage d'affichage

# parat_dfactor
source: Display Factor
de: Anzeige Faktor
fr: Facteur d'affichage

# tgen_guid
source: Current GUID
de: Aktuelle GUID
fr: GUID actuel

# bagg_changed
source: Last edited at:
de: Zuletzt geändert am:
fr: Dernière modification à:

# vgen_businterface
source: Activate BusInterface
de: BusInterface aktivieren
fr: Interface bus activée

# vgen_busrouter
source: Activate BusInterface Router
de: BusInterface Router aktivieren
fr: Mode routeur activé

# vmem_mod
source: Here is a Module. To know more about this memory section go to the module settings.
de: Hier wird ein Module gespeichert. Um genaueres über die Belegung des Speicherplatzes zu erfahren, schauen Sie bitte in den Einstellungen für das Module nach.
fr: C'est un Module. Pour avoir plus d'info à propos de la partie mémoire allez dans la partie paramètres des modules.

# vmem_gat
source: Here is the GroupAddressTable.
de: Hier wird die Gruppenadresstabelle gespeichert.
fr: Ici la table des adresses de groupes.

# vmem_cot
source: Here is the CommunicationobjectTable.
de: Hier wird die Kommunikationsobjekttabelle gespeichert.
fr: Ici la table des objets de communication.

# vmem_ast
source: Here is the AssoziationTable.
de: Hier wird die Assoziationstabelle gespeichert.
fr: Table des associations.

# submod_open
source: Edit SubModules
de: SubModule bearbeiten
fr: Editer le sous module

# tpub_filename
source: File Name:
de: Dateiname:
fr: Nom de fichier :

# main_l1
source: Welcome to Kaenx-Creator!
de: Willkommen bei Kaenx-Creator!
fr: Bienvenue à Kaenx-Creator!

# main_l2
source: To start with a new project or open one
de: Um ein neues Projekt zu beginnen, oder ein bestehendes zu öffnen
fr: Pour démarrer, créez un nouveau projet ou ouvrez en un existant

# main_l3
source: select 'Project' in the Top Menu.
de: wählen Sie oben im Menü 'Projekt' aus.
fr: Sélectionner 'Projet'' dans le menu principal.

# main_l4
source: Kaenx-Creator is part of OpenKNX.
de: Der Kaenx-Creator ist ein Teil von OpenKNX.
fr: Kaenx-Creator fait partie de OpenKNX.

# main_l5
source: Find more information here
de: Mehr Informationen auf
fr: Trouvez plus d'informations ici

# menu_info
source: Info
fr: Information

# editor_save
source: Save
de: Speichern
fr: Enregistrer

# editor_cancel
source: Cancel
de: Abbrechen
fr: Annuler

# tprod_own
source: Own Procedure
de: Eigene Prozedur
fr: Votre propre procédure

# tprod_mask
source: Mask Procedures
de: Prozeduren der Maske
fr: Masques des procédures

# tprod_edit
source: Edit Procedure
de: Prozedur bearbeiten
fr: Éditer la procédure

# tmem_settings
source: Settings
de: Einstellungen
fr: Paramètres

# tmem_heatmap
source: Memory usage
de: Speicherbelegung
fr: Utilisation de la mémoire

# prop_allocs
source: Allocates
de: Allokiert
fr: Alloué

# tabs_sm
source: SubModules
de: SubModule
fr: Sous module

# mem_para
source: Parameters
de: Parameter
fr: Paramètre

# mem_module
source: A Module will be saved here. To get more information go to the modules general page.
de: Hier wird ein Module gespeichert. Um genaueres über die Belegung des Speicherplatzes zu erfahren, schauen Sie bitte in den Einstellungen für das Module nach.
fr: C'est un Module. Pour plus d'info à propos de la partie mémoire allez dans la partie paramètres des modules.

# mem_gat
source: The GroupAddressTable will be saved here.
de: Hier wird die Gruppenadresstabelle gespeichert.
fr: Ici la table des adresses de groupes.

# mem_cot
source: The ComObjectTable will be saved here.
de: Hier wird die Kommunikationsobjekttabelle gespeichert.
fr: Ici la table des objets de communication.

# mem_ast
source: The AssoziationTable will be placed here.
de: Hier wird die Assoziationstabelle gespeichert.
fr: Table des associations.

# tmod_prefix
source: Prefix
fr: Préfixe

# topen_branch
source: Branch (Commit)
fr: Branche (Commit)

# topen_numchannels
source: %N% replacements
de: %N% ersetzungen
fr: %N% remplacements
