Repository: OpenKNX/Kaenx-Creator
Catalog: Kaenx.Creator/Properties/Resources.*.resx
Languages: de, fr

# topen_update
source: Update
fr: Mettre à jour

# topen_haspart
source: Has Parts
de: Enthält Parts
fr: Possède des éléments

# topen_hasshare
source: Has Share
de: Enthält Share
fr: Possède un Share

# topen_hastempl
source: Has Template
de: Enthält Template
fr: Possède un Modèle

# tcom_flag_enable
source: Enable
de: Aktiviert
fr: Activer

# tcom_flag_disable
source: Disable
de: Deaktiviert
fr: Désactiver

# menu_sign
source: Sign
de: Signieren
fr: Signer

# menu_sign_folder
source: Folder
de: Ordner
fr: Répertoire

# import_diff_manu
source: The manufacturer of the product database does not match the manufacturer of the project.\r\nDo you want to change your manufacturer ID from {0} to {1}?
de: Hersteller der Produktdatenbank stimmt nicht mit dem Hersteller des Projekts über ein.\r\nWollen Sie ihre HerstellerId von {0} auf {1} ändern?
fr: Le fabricant de la base de données produit ne correspond pas au fabricant du projet.\r\nVoulez-vous changer votre ID fabricant de {0} à {1} ?

# import_diff_manu_title
source: Manufacturer missmatch
de: Hersteller unterschiedlich
fr: Incohérence de fabricant

# vgen_includeoffset
source: Include KO-Offset in base define
de: Base definition beinhaltet das KO-Offset
fr: Inclure le décalage KO dans la définition de base

# tabs_apps
source: Applications
de: Applikationen

# tabs_app
source: Application
de: Applikation

# gen_desc
source: Description
de: Beschreibung

# tabs_module
source: Modules
de: Module

# tabs_msg
source: Messages
de: Meldungen

# tabs_arg
source: Arguments
de: Argumente

# tdyn_mods
source: Modules
de: Module

# tdyn_args
source: Arguments
de: Argumente

# tdyn_type
source: Type
de: Typ

# tdyn_cond
source: Condition
de: Bedingung

# tdyn_tcond
source: Condition
de: Bedingung

# prop_max
source: Maximum
de: Maximal

# mem_bcu1
source: The BCU1 load prodecure data will be placed here.
de: Hier werden die Ladeprozedur Daten der BCU1 gespeichert.

# gen_translate
source: Open Translator
de: Übersetzer öffnen

# menu_options
source: Options
de: Optionen

# menu_out
source: KnxProd Output Path
de: KnxProd Ausgabepfad

# menu_out_exe
source: Path of EXE File
de: Im Pfad der EXE Datei

# menu_out_ae
source: Path of AE File
de: Im Pfad der AE Datei

# tuni_settings
source: Settings
de: Einstellungen

# tuni_heatmap
source: Memory Map
de: Speicherbelegung

# tabs_proj
source: Project
de: Projekt

# tcom_flags
source: ComObject Flags
de: KommObjekt Flags

# tcom_trans
source: ComObject transmitts to bus
de: KommObjekt sendet auf den Bus

# tcom_recv
source: ComObject receives from bus
de: KommObjekt empfängt vom Bus

# tcom_overwrite
source: Overwrite
de: Überschreiben

# parat_bagg
source: Baggage
de: Anhang

# parat_halign
source: Horizontal Alignment
de: Horizontale Ausrichtung

# parat_display
source: Display
de: Anzeige

# parat_unit
source: Unit
de: Einheit

# parat_export_enum
source: Export in knxprod.h file
de: Exportiere in knxprod.h Datei

# tabs_scripts
source: Scripts
de: Skripte

# gen_translate_fix
source: Fix language
de: Sprache reparieren

# vgen_secure
source: Activate secure
de: Secure aktivieren

# vgen_businterface_count
source: Number of tunneling interfaces
de: Anzahl an Tunneln
